name: "segment_anything2"
platform: "onnxruntime_onnx"
max_batch_size: 0
input [
  {
    name: "image"
    data_type: TYPE_FP32
    dims: [ 1, 3, 1024, 1024 ]
  },
  {
    name: "bbox_coords"
    data_type: TYPE_FP32
    dims: [ -1, 4 ]
  },
  {
    name: "point_coords"
    data_type: TYPE_FP32
    dims: [ -1, -1, 2 ]
  },
  {
    name: "point_labels"
    data_type: TYPE_INT32
    dims: [ -1, -1 ]
  },
  {
    name: "mask_memory"
    data_type: TYPE_FP32
    dims: [ -1, 4, 64, 64, 64 ]
  },
  {
    name: "obj_ptr_memory"
    data_type: TYPE_FP32
    dims: [ -1, 2, 256 ]
  },
  {
    name: "original_size"
    data_type: TYPE_INT32
    dims: [ 2 ]
  },
  {
    name: "permutation"
    data_type: TYPE_INT64
    dims: [ -1 ]
  }
]
output [
  {
    name: "high_res_masks"
    data_type: TYPE_FP32
    dims: [-1, -1, -1, -1]
  },
  {
    name: "object_score_logits"
    data_type: TYPE_FP32
    dims: [-1, -1]
  },
  {
    name: "maskmem_features"
    data_type: TYPE_FP32
    dims: [-1, -1, -1, -1]
  },
  {
    name: "maskmem_pos_enc"
    data_type: TYPE_FP32
    dims: [-1, -1, -1, -1]
  },
  {
    name: "obj_ptr_features"
    data_type: TYPE_FP32
    dims: [-1, -1]
  }
]
version_policy: {
  specific {
    versions: [ 1 ]
  }
}

